app/views/flavors/index.html.haml

              .post-thumb
                %img.img-thumbnail{:src => File.join(".","flavorsUploads",flavor.flavorImgURL), :height=>"150px"}/
              .post-content
---
SELECT "flavors".* FROM "flavors"