app/views/cakes/index.html.haml

                %a{:href => "/cake_orders/"+cake.id.to_s+"/previous"}
                  %img.img-thumbnail{:src => File.join("..","previousCake",cake.decorationImgURL), :height=>"150px"}/
              .post-content
---
SELECT "cakes".* FROM "cakes"