app/controllers/flavors_controller.rb

  def index
    @flavors = Flavor.all
---
SELECT "flavors".* FROM "flavors"

  def create
    logger.debug "Something HERE"
    logger.debug params
    logger.debug flavor_params
    logger.debug "**************************"
    uploaded_io = params[:flavor][:flavorImgURL]
    File.open(Rails.root.join('public', 'flavorsUploads', uploaded_io.original_filename), 'wb') do |file|
    file.write(uploaded_io.read)
    logger.debug uploaded_io.read
    end
    aux = {name: params[:flavor][:name],flavorImgURL: uploaded_io.original_filename};
    @flavor = Flavor.new(aux)
    respond_to do |format|
      if @flavor.save
---
INSERT INTO "flavors" ("name", "flavorImgURL", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Red Velvet"], ["flavorImgURL", "#<ActionDispatch::Http::UploadedFile:0x007f5b168e5260>"], ["created_at", "2018-04-02 21:35:07.017985"], ["updated_at", "2018-04-02 21:35:07.017985"]]

  def destroy
    @flavor.destroy
---
DELETE FROM "flavors" WHERE "flavors"."id" = $1  [["id", 1]]

    def set_flavor
      @flavor = Flavor.find(params[:id])
---
SELECT  "flavors".* FROM "flavors" WHERE "flavors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]