app/controllers/users_controller.rb

  def index
    logger.debug "User/Index"
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    puts "users ctrl -- create"

    @user_check_username = User.find_by_userName(params[:username])
    @user_check_email = User.find_by_userName(params[:email])
    if ( @user_check_username == nil && @user_check_email == nil )
      puts "@user nil"

      @user = User.new(user_params)
      puts "@user.userName = #{@user.userName}"
      puts "@user.password = #{@user.password}"
      if (@user.password.length>=6)
        if (@user.userName == 'admin' && @user.password == 'adminPW')
          puts "admin case"
          @user.role = 1
        end
        respond_to do |format|
          if @user.save
---
INSERT INTO "users" ("userName", "password", "name", "lastName", "phone", "email", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

    def set_user
      puts "users ctrl -- set_user"
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]